package ru.job4j.architecture.dbmanagementuser;
/**
 * в этом пакете содержаться классы и интерефейсы для управления базами данных
 * DbinitAdres -  класс для инициализации базы даных адресов
 * DbStore класс для добавления, удаления, радактирования, пользователей в частности имена логиы, пароли адреса
 * DispatchDispason  класс диспетвер который пересылает команды класам для управления базами даннхы комында приходят с сервлетов
 * MemoryStore  начальная база на хешкарте устаревшая реализация
 * ValidateService  класс прокладка - проверяет  данные прежде чем их внести
 *
 **/